<a href="https://colab.research.google.com/github/sakship1920/Machine-Learning/blob/main/avacado.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [2]:
df=pd.read_csv('/content/dataset_39_1-avocado - dataset_39_1-avocado.csv')
df.head()

   Unnamed: 0        Date  AveragePrice  ...          type  year  region
0           0  2015-12-27          1.33  ...  conventional  2015  Albany
1           1  2015-12-20          1.35  ...  conventional  2015  Albany
2           2  2015-12-13          0.93  ...  conventional  2015  Albany
3           3  2015-12-06          1.08  ...  conventional  2015  Albany
4           4  2015-11-29          1.28  ...  conventional  2015  Albany

[5 rows x 14 columns]

In [3]:
df.type.unique()

array(['conventional', 'organic'], dtype=object)

In [4]:
df=df.drop(['Unnamed: 0','Date'],axis=1)
df.head(2)

   AveragePrice  Total Volume     4046  ...          type  year  region
0          1.33      64236.62  1036.74  ...  conventional  2015  Albany
1          1.35      54876.98   674.28  ...  conventional  2015  Albany

[2 rows x 12 columns]

In [5]:
from sklearn.preprocessing import LabelEncoder
var=['type','year','region']
le=LabelEncoder()
for i in var:
  df[i]=le.fit_transform(df[i])
df.head(4)

   AveragePrice  Total Volume     4046  ...  type  year  region
0          1.33      64236.62  1036.74  ...     0     0       0
1          1.35      54876.98   674.28  ...     0     0       0
2          0.93     118220.22   794.70  ...     0     0       0
3          1.08      78992.15  1132.00  ...     0     0       0

[4 rows x 12 columns]

In [6]:
X= df.drop('type',axis=1)
y=df['type']

In [7]:
X_train,X_test,y_train,y_test= train_test_split(X,y,test_size=0.2,random_state=0)

In [8]:
from sklearn.preprocessing import StandardScaler
sc= StandardScaler()
X_train= sc.fit_transform(X_train)
X_test=sc.fit_transform(X_test)

In [9]:
from sklearn.svm import SVC
my_model= SVC(kernel='rbf',random_state=0)
result=my_model.fit(X_train,y_train)

In [10]:
predictions= result.predict(X_test)
predictions

array([1, 0, 1, ..., 1, 1, 1])

In [11]:
accuracy_score(y_test,predictions)

0.9347945205479452

In [12]:
from sklearn.metrics import confusion_matrix
conf_matrix =confusion_matrix(predictions,y_test)
confusion_df = pd.DataFrame(conf_matrix, index=['Actual 0','Actual 1'], columns=['Predicted 0','Predicted 1'])
confusion_df

          Predicted 0  Predicted 1
Actual 0         1612           75
Actual 1          163         1800

In [13]:
new_pred= list(result.predict([[1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,0,0]]))
new_pred

[0]